데이터에서 빠진 부분을 제거하는 방법에 대해 알아보자.  
이 예에서는 DataFrame의 일부 항목이 null 값을 가지도록 만들자.  
이 때, Numpy.nan 값은 (Not a Number), None 이런 값이 빠진 값을 의미한다.  
예를 들어 SQL에서도  
  
Insert into members(id, name, dept) values(1, '홍길동', null); // null은 Unkown, N/A (Not Applicable)  
select * from members where dept=  NULL;  
select * from members where dept is null;  
insert into members(id, name, dept) values(1, '홍길동', '소속없음');

In [1]:
import pandas as pd
import numpy as np

In [2]:
people = {
    'first' : ['길동', '춘향', '몽룡' ,'찬호', np.nan, None, 'N/A'],
    'last' : ['홍', '성', '이' , '박', np.nan, np.nan, 'Missing'],
    'email' : ['gdhong@gamil', 'chsung@gamil.com', 'mrlee@gmail.com', np.nan, None, np.nan, 'anonymous@gmail.com'],
    'age' : [22, 18, 23, 45, None, None, 'Missing']
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

  first     last                email      age
0    길동        홍         gdhong@gamil       22
1    춘향        성     chsung@gamil.com       18
2    몽룡        이      mrlee@gmail.com       23
3    찬호        박                  NaN       45
4   NaN      NaN                 None     None
5  None      NaN                  NaN     None
6   N/A  Missing  anonymous@gmail.com  Missing

데이터프레임의 dropna()를 이용해 빠진 값을 가진 행을 제거해보자.

In [5]:
df.dropna()

  first     last                email      age
0    길동        홍         gdhong@gamil       22
1    춘향        성     chsung@gamil.com       18
2    몽룡        이      mrlee@gmail.com       23
6   N/A  Missing  anonymous@gmail.com  Missing

dropna()는 옵션을 가진다. 옵션을 주지 않으면 다음과같은디폴트 옵션을 가진다.
dropna() == dropa(axis='index', how='any')

axis는 'index' 또는 'column'을 값으로 가진다.
axis가 'index'인 경우, 빠진 값을 가지는 행을 드롭하겠다는 의미이다
axis가 'columns'인 경우, 빠진 값을 가지는 열을 드롭하겠다는 의미이다
how가 'any'인 경우, 빠진 값이 하나라도 있으면 드롭하겠다는 의미이다.
how가 'all'인 경우, 모든 값이 빠진 경우에만 드롭하겠다는 의미이다.

In [6]:
df

  first     last                email      age
0    길동        홍         gdhong@gamil       22
1    춘향        성     chsung@gamil.com       18
2    몽룡        이      mrlee@gmail.com       23
3    찬호        박                  NaN       45
4   NaN      NaN                 None     None
5  None      NaN                  NaN     None
6   N/A  Missing  anonymous@gmail.com  Missing

In [7]:
df.dropna(axis='index', how='all')

  first     last                email      age
0    길동        홍         gdhong@gamil       22
1    춘향        성     chsung@gamil.com       18
2    몽룡        이      mrlee@gmail.com       23
3    찬호        박                  NaN       45
6   N/A  Missing  anonymous@gmail.com  Missing

In [8]:
df.dropna(axis='columns', how='all')

  first     last                email      age
0    길동        홍         gdhong@gamil       22
1    춘향        성     chsung@gamil.com       18
2    몽룡        이      mrlee@gmail.com       23
3    찬호        박                  NaN       45
4   NaN      NaN                 None     None
5  None      NaN                  NaN     None
6   N/A  Missing  anonymous@gmail.com  Missing

In [9]:
df.dropna(axis='columns', how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

# email 칼럼 값이 없는 행만 드롭(삭제) 하시오.

In [10]:
df.dropna(axis='index', subset=['email'])

  first     last                email      age
0    길동        홍         gdhong@gamil       22
1    춘향        성     chsung@gamil.com       18
2    몽룡        이      mrlee@gmail.com       23
6   N/A  Missing  anonymous@gmail.com  Missing

In [11]:
df.dropna(axis='index', how='any')

  first     last                email      age
0    길동        홍         gdhong@gamil       22
1    춘향        성     chsung@gamil.com       18
2    몽룡        이      mrlee@gmail.com       23
6   N/A  Missing  anonymous@gmail.com  Missing

# last 칼럼 값과 eamil 칼럼 값 모두가 빠진 행을 찾아 삭제하시오.

In [12]:
df.dropna(axis='index', subset=['last','email'], how='all')

  first     last                email      age
0    길동        홍         gdhong@gamil       22
1    춘향        성     chsung@gamil.com       18
2    몽룡        이      mrlee@gmail.com       23
3    찬호        박                  NaN       45
6   N/A  Missing  anonymous@gmail.com  Missing

In [13]:
df.dropna(axis='columns', how='all')

  first     last                email      age
0    길동        홍         gdhong@gamil       22
1    춘향        성     chsung@gamil.com       18
2    몽룡        이      mrlee@gmail.com       23
3    찬호        박                  NaN       45
4   NaN      NaN                 None     None
5  None      NaN                  NaN     None
6   N/A  Missing  anonymous@gmail.com  Missing

In [14]:
df.dropna(axis='columns', how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [15]:
df.dropna(axis='index', subset=['email'])

  first     last                email      age
0    길동        홍         gdhong@gamil       22
1    춘향        성     chsung@gamil.com       18
2    몽룡        이      mrlee@gmail.com       23
6   N/A  Missing  anonymous@gmail.com  Missing

last칼럼 값과 eamil 칼럼 값 모두가 빠진 경우에만 그 행을 드롭하고 싶다면

In [16]:
df.dropna(axis='index', subset=['email', 'last'], how='all')

  first     last                email      age
0    길동        홍         gdhong@gamil       22
1    춘향        성     chsung@gamil.com       18
2    몽룡        이      mrlee@gmail.com       23
3    찬호        박                  NaN       45
6   N/A  Missing  anonymous@gmail.com  Missing

dropna() 를 통해 DataFrame 원본을 변경하고자 한다면 inplace=True 로 설정한다  
  
빠진 값을 나타내기 위해 임의로 사용한 'NA', 'Missing' 값을 다루는 방법에 대해 알아보자.  
다음과 같이 DataFrame에서 이러한 임의의 값을 np.nan 값으로 치환하자.

In [17]:
df.replace('NA', np.nan, inplace=True)

In [18]:
df

  first     last                email      age
0    길동        홍         gdhong@gamil       22
1    춘향        성     chsung@gamil.com       18
2    몽룡        이      mrlee@gmail.com       23
3    찬호        박                  NaN       45
4   NaN      NaN                 None     None
5  None      NaN                  NaN     None
6   N/A  Missing  anonymous@gmail.com  Missing

In [19]:
df.replace('Missing', np.nan, inplace=True)

In [20]:
df

  first last                email   age
0    길동    홍         gdhong@gamil  22.0
1    춘향    성     chsung@gamil.com  18.0
2    몽룡    이      mrlee@gmail.com  23.0
3    찬호    박                  NaN  45.0
4   NaN  NaN                 None   NaN
5  None  NaN                  NaN   NaN
6   N/A  NaN  anonymous@gmail.com   NaN

In [21]:
df.dropna()

  first last             email   age
0    길동    홍      gdhong@gamil  22.0
1    춘향    성  chsung@gamil.com  18.0
2    몽룡    이   mrlee@gmail.com  23.0

In [22]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True   True   True
6  False   True  False   True

경우에 따라, na값을 다른 값으로 치환할 필요가 있다.  
예를 들어, 과제 점수를 계산하는 경우를 고려해보자.  
  
제출이 안된 과제는 na 값을 가진다고 할 때, 그 na 값을 0으로 치환하자.

In [23]:
df

  first last                email   age
0    길동    홍         gdhong@gamil  22.0
1    춘향    성     chsung@gamil.com  18.0
2    몽룡    이      mrlee@gmail.com  23.0
3    찬호    박                  NaN  45.0
4   NaN  NaN                 None   NaN
5  None  NaN                  NaN   NaN
6   N/A  NaN  anonymous@gmail.com   NaN

In [24]:
df.fillna('Missing')

     first     last                email      age
0       길동        홍         gdhong@gamil     22.0
1       춘향        성     chsung@gamil.com     18.0
2       몽룡        이      mrlee@gmail.com     23.0
3       찬호        박              Missing     45.0
4  Missing  Missing              Missing  Missing
5  Missing  Missing              Missing  Missing
6      N/A  Missing  anonymous@gmail.com  Missing

In [25]:
df.fillna(0)

  first last                email   age
0    길동    홍         gdhong@gamil  22.0
1    춘향    성     chsung@gamil.com  18.0
2    몽룡    이      mrlee@gmail.com  23.0
3    찬호    박                    0  45.0
4     0    0                    0   0.0
5     0    0                    0   0.0
6   N/A    0  anonymous@gmail.com   0.0

In [26]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [27]:
type(np.nan)

float

In [28]:
df['age'].astype(int)

ValueError: Cannot convert non-finite values (NA or inf) to integer

In [29]:
df.fillna(0)

  first last                email   age
0    길동    홍         gdhong@gamil  22.0
1    춘향    성     chsung@gamil.com  18.0
2    몽룡    이      mrlee@gmail.com  23.0
3    찬호    박                    0  45.0
4     0    0                    0   0.0
5     0    0                    0   0.0
6   N/A    0  anonymous@gmail.com   0.0

In [30]:
df2 = df.fillna(0)

In [31]:
df2['age'].astype(int)

0    22
1    18
2    23
3    45
4     0
5     0
6     0
Name: age, dtype: int32

In [32]:
df2

  first last                email   age
0    길동    홍         gdhong@gamil  22.0
1    춘향    성     chsung@gamil.com  18.0
2    몽룡    이      mrlee@gmail.com  23.0
3    찬호    박                    0  45.0
4     0    0                    0   0.0
5     0    0                    0   0.0
6   N/A    0  anonymous@gmail.com   0.0

In [34]:
df2['age'] = df2['age'].astype(int)

In [35]:
df2

  first last                email  age
0    길동    홍         gdhong@gamil   22
1    춘향    성     chsung@gamil.com   18
2    몽룡    이      mrlee@gmail.com   23
3    찬호    박                    0   45
4     0    0                    0    0
5     0    0                    0    0
6   N/A    0  anonymous@gmail.com    0

In [36]:
df['age']

0    22.0
1    18.0
2    23.0
3    45.0
4     NaN
5     NaN
6     NaN
Name: age, dtype: float64

In [40]:
df = pd.read_csv('./survey_results_public.csv')
schema_df = pd.read_csv('./survey_results_schema.csv')

In [41]:
df[df.isna() == True]

,Respondent,MainBranch,Hobbyist,OpenSourcer,OpenSource,Employment,Country,Student,EdLevel,UndergradMajor,...,WelcomeChange,SONewContent,Age,Gender,Trans,Sexuality,Ethnicity,Dependents,SurveyLength,SurveyEase
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88878,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
88879,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
88880,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
88881,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
88882,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

CSV 파일을 DataFrame으로 읽어들이면서, 빠진 값을 나태내기 위해 'NA' 또는 'Missing' 이라는 임의의 값을 가진 셀이 있다면  
그 값을 np.nan 값으로 변경하고자 한다면 ,,,

In [43]:
df = pd.read_csv('./survey_results_public.csv', index_col = 'Respondent', na_values=['NA', 'Missing'])

예제에 사용된 csv 파일에는 빠진 값을 나타내기 위해 임의로 사용된 값은 없다. 따라서 위와 같이 해도 달라지는 건 없다.

응답자들의 평균 개발년수를 구하시오.
개발년수는 'YearsCode' 칼럼에 기록되어 있다.

In [45]:
df['YearsCode'].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 'Less than 1 year', '30', '9', '26', '40', '19',
       '15', '20', '28', '25', '1', '22', '11', '33', '50', '41', '18',
       '34', '24', '23', '42', '27', '21', '36', '32', '39', '38', '31',
       '37', 'More than 50 years', '29', '44', '45', '48', '46', '43',
       '47', '49'], dtype=object)

In [44]:
df['YearsCode']

Respondent
1          4
2        NaN
3          3
4          3
5         16
        ...
88377    NaN
88601    NaN
88802    NaN
88816    NaN
88863      8
Name: YearsCode, Length: 88883, dtype: object

In [46]:
df.['YearsCode'].mean()

SyntaxError: invalid syntax (<ipython-input-46-6d8dca032f4b>, line 1)

In [47]:
type(df.loc[1, 'YearsCode'])

str

In [48]:
df['YearsCode'] = df['YearsCode'].astype(float)

ValueError: could not convert string to float: 'Less than 1 year'

In [49]:
df['YearsCode'].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 'Less than 1 year', '30', '9', '26', '40', '19',
       '15', '20', '28', '25', '1', '22', '11', '33', '50', '41', '18',
       '34', '24', '23', '42', '27', '21', '36', '32', '39', '38', '31',
       '37', 'More than 50 years', '29', '44', '45', '48', '46', '43',
       '47', '49'], dtype=object)

In [50]:
df['YearsCode'] = df['YearsCode'].replace('Less than 1 year' , 0)

In [51]:
df['YearsCode'].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 0, '30', '9', '26', '40', '19', '15', '20', '28',
       '25', '1', '22', '11', '33', '50', '41', '18', '34', '24', '23',
       '42', '27', '21', '36', '32', '39', '38', '31', '37',
       'More than 50 years', '29', '44', '45', '48', '46', '43', '47',
       '49'], dtype=object)

In [52]:
df['YearsCode'] = df['YearsCode'].replace('More than 50 years' , 51)

In [53]:
df['YearsCode'].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 0, '30', '9', '26', '40', '19', '15', '20', '28',
       '25', '1', '22', '11', '33', '50', '41', '18', '34', '24', '23',
       '42', '27', '21', '36', '32', '39', '38', '31', '37', 51, '29',
       '44', '45', '48', '46', '43', '47', '49'], dtype=object)

In [54]:
df['YearsCode'] = df['YearsCode'].astype(float)

In [55]:
df['YearsCode'].unique()

array([ 4., nan,  3., 16., 13.,  6.,  8., 12.,  2.,  5., 17., 10., 14.,
       35.,  7.,  0., 30.,  9., 26., 40., 19., 15., 20., 28., 25.,  1.,
       22., 11., 33., 50., 41., 18., 34., 24., 23., 42., 27., 21., 36.,
       32., 39., 38., 31., 37., 51., 29., 44., 45., 48., 46., 43., 47.,
       49.])

In [57]:
df['YearsCode'].dtypes

dtype('float64')

In [58]:
df['YearsCode'].mean()

11.662114216834588

In [59]:
df['YearsCode'].median()

9.0